'''Выведите на экран таблицу умножения числа 5.
Сделайте таблицу через цикл for.
В каждом цикле число 5 должно умножаться от 1 до 10 включительно.'''
for x in range(1,11):
    print(f'5 * {x} = {5*x}')