'''Цикл do while
В языке Python нет цикла do..while, тем не менее его можно с легкостью создать собственноручно.
Создайте такой цикл.
Для тех кто не знает, цикл do..while это цикл который выполняется хотя бы один раз,
после чего проверяет условие и если оно не верно, то выходит из цикла,
иначе продолжает следующую итерацию.'''

i = 2
while True:
    print(i)
    if i == 2:
        break
